Enums/ГруппировкаАнализаБизнеса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ГруппировкаАнализаБизнеса</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Показатели</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Проекты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подразделения</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ПланФакт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ПланФакт</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Факт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>План</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПланФакт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ПоказателиЕНВД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Document>
		<Properties>
			<Name>ПоказателиЕНВД</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>999</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДнейВсего1</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДнейВсего2</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДнейВсего3</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПоказателиЕНВД</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидДеятельностиЕНВД</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыДеятельностиЕНВД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеФизическогоПоказателя1</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыработкаДней1</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеФизическогоПоказателя2</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыработкаДней2</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеФизическогоПоказателя3</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыработкаДней3</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

CommonModules/АссистентУправленияКлиентПереопределяемый/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

Процедура ОбработатьПроизвольноеДействиеСообщенияАссистента(ОписаниеСообщения) Экспорт
	ДанныеДляПерехода = ОписаниеСообщения.Данные;
	Если ОписаниеСообщения.ВыбранноеДействие = "ПерейтиКЗадачеПоНалогам" Тогда
		Если ТипЗнч(ДанныеДляПерехода) = Тип("Структура") Тогда
			ОткрытьФорму(ДанныеДляПерехода.ИмяФормыЗадачи, ДанныеДляПерехода.ПараметрыОткрытия);
			Возврат;
		КонецЕсли;
	ИначеЕсли ОписаниеСообщения.ВыбранноеДействие = "ПерейтиККУДиР" Тогда
		Если ТипЗнч(ДанныеДляПерехода) = Тип("Структура") Тогда
			ПараметрыФормы = Новый Структура("Организация", ДанныеДляПерехода.ПараметрыОткрытия.Организация);
			ОткрытьФорму("Документ.ЗаписиУСН.Форма.ФормаСпискаЗаписиПрочие", ПараметрыФормы);
		КонецЕсли;
	ИначеЕсли ОписаниеСообщения.ВыбранноеДействие = "ПерейтиКПоказателямПоЕНВД" Тогда
		Если ТипЗнч(ДанныеДляПерехода) = Тип("Структура") Тогда
			ОткрытьФорму("Документ.ПоказателиЕНВД.ФормаОбъекта", ДанныеДляПерехода.ПараметрыОткрытия);
		КонецЕсли;
	ИначеЕсли ОписаниеСообщения.ВыбранноеДействие = "ОткрытьРасчетПотребностейМинимальныеОстаткиЗапасов" Тогда
		ЗаголовокПодборкиСпискаНоменклатуры = СтрШаблон(НСтр("ru='Рекомендации Даши (%1)'"), ОписаниеСообщения.Данные.Номенклатура.Количество());
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("СпособПополнения", "Закупки");
		ПараметрыФормы.Вставить("Организация", ОписаниеСообщения.Данные.Организация);
		ПараметрыФормы.Вставить("Склад", ОписаниеСообщения.Данные.СтруктурнаяЕдиница);
		ПараметрыФормы.Вставить("Номенклатура", ОписаниеСообщения.Данные.Номенклатура);
		ПараметрыФормы.Вставить("ЭтоНоменклатураПодборкаАссистента", Истина);
		ПараметрыФормы.Вставить("ЗаголовокПодборкиСпискаНоменклатуры", ЗаголовокПодборкиСпискаНоменклатуры);
		ОткрытьФорму("Обработка.РасчетПотребностей.Форма.Форма", ПараметрыФормы);
	ИначеЕсли ОписаниеСообщения.ВыбранноеДействие = "Подробнее..." Тогда
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("СценарийПланирования", ПредопределенноеЗначение("Справочник.СценарииПланирования.Фактический"));
		ПараметрыОтбора.Вставить("Группировка", ПредопределенноеЗначение("Перечисление.ГруппировкаАнализаБизнеса.Показатели"));
		ПараметрыОтбора.Вставить("ПланФакт", ПредопределенноеЗначение("Перечисление.ПланФакт.Факт"));
		ПараметрыОтбора.Вставить("НачалоПериода", ДанныеДляПерехода.НачалоПериода);
		ПараметрыОтбора.Вставить("КонецПериода", ДанныеДляПерехода.КонецПериода);
		ПараметрыОтбора.Вставить("ПланФакт", ПредопределенноеЗначение("Перечисление.ПланФакт.Факт"));
		ПараметрыОтбора.Вставить("АктивныйОтчет", ДанныеДляПерехода.АктивныйОтчет);
		ПараметрыОтбора.Вставить("Периодичность", ДанныеДляПерехода.Периодичность);
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Отбор", ПараметрыОтбора);
		ОткрытьФорму("Отчет.АнализБизнеса.Форма.Форма", ПараметрыФормы);
	ИначеЕсли ОписаниеСообщения.ВыбранноеДействие = "ПерейтиКДокументамПлатежноеПоручение"
		Или ОписаниеСообщения.ВыбранноеДействие = "ПерейтиКДокументам" Тогда
		ОткрытьФорму("Документ.ПлатежноеПоручение.ФормаСписка");
		Оповестить("УстановитьТекущуюСтраницуПлатежноеПоручение", "СтраницаПлатежныеПоручения");
	ИначеЕсли ОписаниеСообщения.ВыбранноеДействие = "ПерейтиКСозданиюДокументовПлатежноеПоручение"
		Или ОписаниеСообщения.ВыбранноеДействие = "ПерейтиКСозданиюДокументов" Тогда
		ОткрытьФорму("Документ.ПлатежноеПоручение.ФормаСписка");
		Оповестить("УстановитьТекущуюСтраницуПлатежноеПоручение", "СтраницаРегулярныеПлатежи");
	ИначеЕсли ОписаниеСообщения.ВыбранноеДействие = "ПерейтиКДокументамРасходДСПлан" Тогда
		ОткрытьФорму("Документ.РасходДСПлан.ФормаСписка");
		Оповестить("УстановитьТекущуюСтраницуРасходДСПлан", "СтраницаЗаявкиНаРасходДенег");
	ИначеЕсли ОписаниеСообщения.ВыбранноеДействие = "ПерейтиКСозданиюДокументовРасходДСПлан" Тогда
		ОткрытьФорму("Документ.РасходДСПлан.ФормаСписка");
		Оповестить("УстановитьТекущуюСтраницуРасходДСПлан", "СтраницаРегулярныеПлатежи");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
